rammp-org/pace-racer-fw/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

# ESP32-specific
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Common ESP-related
#
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Ethernet (WIZnet W5500 on the SPI expansion header)
#
CONFIG_ETH_ENABLED=y
# enable the W5500 driver inside espp::Ethernet
CONFIG_ESPP_ETHERNET_W5500=y
